#這個作業主要是要測試查詢[Order], [Order Details]，但關聯的Table還有[Employees], [Customers], [Shippers]
#為了減少初始化資料，若將全部測試資料事先建在測試DB，則情境說明會有缺少

#問題：
#可以在這裡註明資料來源就好？例：［Order］ join ［Order Details］
#或是需要在 Background 提供[Order], [Order Details]的資料?只將其他關聯資料先建好?

Feature: 查詢訂單
	身為採購人員，我需要知道有哪些訂單，以利後續作業。

Scenario: 我在訂單作業查詢訂單資料
	Given 查詢條件
	| CustomerID | OrderDate |
	| VINET      |           | 
	When 我調用GetOrders
	Then 我會得到訂單資料如下
	| OrderID | CustomerID | EmployeeID | OrderDate               | RequiredDate            | ProductID | UnitPrice | Quantity | Discount |
	| 10248   | VINET      | 5          | 1996-07-04 00:00:00.000 | 1996-08-01 00:00:00.000 | 11        | 14.00     | 12       | 0        |
	| 10248   | VINET      | 5          | 1996-07-04 00:00:00.000 | 1996-08-01 00:00:00.000 | 42        | 9.80      | 10       | 0        |
	| 10248   | VINET      | 5          | 1996-07-04 00:00:00.000 | 1996-08-01 00:00:00.000 | 72        | 34.80     | 5        | 0        |
	| 10274   | VINET      | 6          | 1996-08-06 00:00:00.000 | 1996-09-03 00:00:00.000 | 71        | 17.20     | 20       | 0        |
	| 10274   | VINET      | 6          | 1996-08-06 00:00:00.000 | 1996-09-03 00:00:00.000 | 72        | 27.80     | 7        | 0        |
	| 10295   | VINET      | 2          | 1996-09-02 00:00:00.000 | 1996-09-30 00:00:00.000 | 56        | 30.40     | 4        | 0        |
	| 10737   | VINET      | 2          | 1997-11-11 00:00:00.000 | 1997-12-09 00:00:00.000 | 13        | 6.00      | 4        | 0        |
	| 10737   | VINET      | 2          | 1997-11-11 00:00:00.000 | 1997-12-09 00:00:00.000 | 41        | 9.65      | 12       | 0        |
	| 10739   | VINET      | 3          | 1997-11-12 00:00:00.000 | 1997-12-10 00:00:00.000 | 36        | 19.00     | 6        | 0        |
	| 10739   | VINET      | 3          | 1997-11-12 00:00:00.000 | 1997-12-10 00:00:00.000 | 52        | 7.00      | 18       | 0        |
